{
    "segments": [
      {
        "id": "eae6f269-fe98-43a8-90e1-962367a47f78",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to the Noble Lady, the Venerable Tara. 'Homage to Tara' means she who liberates from the suffering of samsara. 'Swift One' means swift in accomplishing the welfare of sentient beings. 'Heroine' means heroine because she conquers the afflictions.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "aa64e0f6-40c9-4439-9391-4a0467b4570d",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "The line 'Whose eyes are like instantaneous lightning' is a simile for clear light.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "d04f6b7e-4cb3-4060-9ec3-8a4c6949ac38",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "The line 'Protector of the three worlds, born from the lotus face' means: Protector of the three worlds refers to Avalokiteshvara. 'Born from the lotus face' means: from his tears arose a lotus or utpala flower. 'Born from the opening of its anthers' means: Tara emerged from the opened lotus.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "f709de0d-9d91-4266-9190-d416279c6b81",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "The line 'Homage to you whose face is like a hundred autumn moons' is a simile for white light. 'Full' means like the full moon. 'Hundred-fold' refers to her face. This means her face is as radiant as hundreds of full moons gathered together.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "20259589-b148-4051-bfb1-ea60ab8a9c13",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "The constellations of thousands of stars, brilliantly illuminating with radiant light - this is a simile for the immeasurable light rays emanating from those two.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5b3cb48a-6438-48a5-9c19-ae18e39d5ccf",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you with golden-blue [complexion] that shines like the light of pure gold. 'Born from water' refers to the lotus emblem. 'Whose hands are adorned with lotuses' means that she holds a lotus in her left hand. 'Giving' refers to the perfection of generosity. 'Diligence' refers to the perfection of diligence. 'Austerity' means moral discipline. 'Peace' refers to afflictive emotions. 'Patience' refers to the perfection of patience. 'Meditation' refers to the perfection of meditation. 'She whose domain is itself' refers to wisdom. From practicing these six perfections, one attains the form of Tara, which is symbolized by the utpala flower.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "f27bad81-9fe6-49aa-babc-b333795e121f",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to the crown of the Tathagatas' means she is like the crown protuberance on the head of all the Tathagatas. 'She who engages in boundless complete victory' means she engages in complete victory over all adversaries such as demons and enemies.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "caac1819-5781-4312-86bc-436898acb6b0",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Who has attained all the perfections without exception' means she has attained the ten perfections which are the essence of all ten grounds without exception. 'Upon whom the sons of the Conquerors rely' - 'sons of the Conqueror' refers to all bodhisattvas. 'Upon whom they rely' means she is held by them in highest esteem.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "37b5d580-2b7f-4891-8a2b-ab084fbf2fdb",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who with TUTTĀRA and HŪṂ' refers to the mantra 'tuttāre hūṃ.' 'Syllables' refers to the power and light rays of those mantra syllables. 'Filling the realms of desire, directions, and space' means filling the desire realm, form realm, and formless realm.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "bb95bbc1-f08f-400f-9751-438e86ab945d",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "\"Having trampled the seven worlds under foot... This refers to trampling the five types of beings in the desire realm, the form realm making six, and the formless realm making seven. One who can summon without remainder... 'Without remainder' means accomplishing the welfare of sentient beings without exception. 'One who can summon' means having the power to control kings and others.\"",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "671e2179-52ee-46c1-8092-28624aa584a1",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you whom Indra, Fire God, Brahma, Wind God, and the Lord of Various Powers worship... This means that the lord of gods Indra, the fire god, Brahma, the wind god, and their master, the great Ishvara (Shiva), offer worship at her feet.\"",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "51fa2fe2-fcb0-43b5-9b6e-60d97b1a836c",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "\"Praised by hosts of spirits, zombies, gandharvas, and yakshas from the front... 'Spirits' refers to Ganapati and others. 'Zombies' refers to Maheshvara and others. 'Gandharvas' refers to the Five-Crested One and others. 'Yakshas' refers to Vaishravana and others. 'By hosts' means she is praised from the front by these and other eight classes of gods and demons.\"",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5e8b2cef-5334-44e8-bc6c-bb58147d839c",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "\"Homage to you who utterly destroy others' magical devices with TRAD and PHAT... This means that with fierce speech she destroys and repels negative practices created by others. 'Right leg bent, left extended' refers to her posture. 'Having trampled under foot' has the meaning explained above.\"",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "429e862e-ed3b-4484-bcda-8968ad17f51b",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "\"Blazing, turbulent, intensely burning... This means she sits majestically in the midst of blazing fire. Homage to you, the terrifying TURE, the great fearsome one... This means that with the terror of TURE she dispels all maras; she is the great fearsome one because she frightens the maras. Destroyer of the heroes of mara... 'Heroes' refers to the mara of afflictions. By conquering this one, she consequently conquers the other three.\"]",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "29d858fe-8ae0-4110-bd38-ebaf3f897ffb",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "The lotus face displays a frown. This means: 'The lotus face' refers to the beautiful face of the glorious lady, like an open lotus flower. 'Displays a frown' means she appears in wrathful form. 'She who kills all enemies without exception' means she destroys all adverse factors such as afflictive emotions and so forth.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "1af38024-beff-4ee0-b447-e0db53f7d58e",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who adorns her heart with her fingers in a mudra symbolizing the Three Jewels. This means: She is adorned by holding a lotus at her heart with the thumb and ring finger of her left hand. The three extended fingers symbolize the Three Jewels.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "b7d504fa-8d51-43e9-b934-bc4aed6b9576",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Adorned with wheels in all directions without exception.' This means: The palm of her right hand, which makes the supreme giving mudra, is adorned with a wheel. 'She who agitates all masses of her own light.' This means: Light rays emanate from the wheel in her hand, outshining all other light.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2bae1c97-ed01-45cd-b40a-ed9412f4076d",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who is intensely joyful and resplendent, whose crown ornament multiplies with garlands of light.' This means: She fulfills the desires of all sentient beings who are intensely joyful. 'Resplendent' means outshining others. Her crown is beautified with garlands of various precious jewels.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "23561efd-515b-432f-b471-ba4d00525cb5",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Through her laughter, the fully laughing Tuttara.' This means: She proclaims the sound of laughter through mantras. 'She who subjugates demons and the world.' This means: Through that sound of mantra laughter, she subjugates demons and the world.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "aba00bd9-6b34-4605-ac6a-a750251075bd",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to the hosts who protect the earth. This refers to the ten directional protectors. The one who can summon all. This refers to those who act as messengers by listening to whatever is said.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "8d5e8fa4-8a33-4b7f-8898-d85902e37343",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "With the syllable HŪṂ that moves with wrathful frown. This refers to the wrathful female's heart being marked with the syllable HŪṂ. The one who completely liberates all the destitute. This refers to liberating all sentient beings who are tormented by unfavorable conditions and deprived of favorable conditions from suffering and establishing them in happiness.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "afe0f65e-83cd-4db5-91ba-1a2f9c228fa2",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to the one whose crown is adorned with a crescent moon. This refers to the head adorned with a crescent moon. The one whose ornaments all brightly blaze. This refers to the light rays blazing from that moon.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "066a0e2b-9bb3-48ec-8f75-c969b2852d7c",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "From Amitābha amidst her hair. This refers to her head being adorned with Amitābha (Boundless Light) within her locks of hair. The one who constantly emits brilliant light. This refers to Amitābha radiating immeasurable light rays for the benefit of sentient beings.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "aecb2c08-3999-44e9-83a2-155f1eb043c2",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to her who dwells amidst garlands blazing like the fire at the end of an eon. This refers to her abiding in the midst of what is like the time at the end of an eon when seven suns appear and all earth, stones, and mountains blaze like fire.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "a5533bdc-29f0-44b8-9794-3ebedd4b03fc",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "With right leg extended, left leg bent, circling with joy. This means: the sitting posture is opposite to the previous one. Destroyer of the forces of enemies. This means: she conquers all adversities.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2649c33b-e643-4bb7-a06a-24618afda03a",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who strike the earth's surface with the palm of your hand and pound it with your feet. This means: with the left hand striking the ground, making the threatening mudra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "3898936b-8e37-4af6-9e56-71fcdea509c9",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Making a wrathful frown, with the syllable HŪṂ. This means: by uttering 'hūṃ' vocally, the right hand holding a vajra from which light rays emanate, filling the abodes of the seven classes of beings. Since this dispels all their obstacles, 'She who destroys the seven levels.' Alternatively, it means she scatters into pieces the nagas and asuras dwelling in the seven levels beneath the earth.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "92da17ed-b6f8-44fb-828a-5f5c53cdb7fe",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who are blissful, virtuous, and peaceful. This means: 'Blissful' refers to possessing uncontaminated bliss; 'Virtuous' means free from afflictions that should be abandoned; 'Peaceful' means acting from a state where suffering is pacified. Your field of activity is peace, nirvana itself. This means: with conceptual thoughts exhausted, there is nirvana; with suffering pacified, one acts in a state of peaceful bliss.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "e4c13cd3-094e-4f17-8fec-040f14c2b85d",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Perfectly endowed with SVĀHĀ and OṂ, Destroyer of great negativities. This means: through my nature as the dharmakāya, I destroy others' afflictions that are to be abandoned.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "46bfe4c0-eb2e-4d6b-a6e1-30c28c031031",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who encircles with complete joy, who utterly destroys the bodies of enemies. With speech arranged in the ten syllables: OṂ TĀRE TUTTĀRE TURE SVĀHĀ. This is the pacifying mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "aea4dce9-ae9f-4fa9-ab0b-faabf06d7dcf",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "From the awareness syllable HŪṂ arises Tārā herself. OṂ NAMAḤ TĀRE NAMO HARI HŪṂ HARA SVĀHĀ. This is the wrathful mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "4f7bb065-6f30-49be-bcfb-fa7667c4918d",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you whose feet stamp with TURE, who are the seed in the form of HŪṂ. This refers to generating oneself in the form of the wrathful deity.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "edf13cfa-b2ec-4212-bcad-ef51cdaf7065",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Mount Meru, Mandāra, and Vindhya. This means: Even Mount Mandāra, which is outside the three thousand worlds, is penetrated by the light rays of the syllable HŪṂ. You who cause the three worlds to tremble. This means: causing the desire realm, form realm, and formless realm to tremble.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "aad8f268-e743-445a-8791-2f5738d764b8",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who holds in your hand the mark of a deer in the form of a divine lake. This means: holding in her hand the moon disc like a divine lake. This is the symbol that removes the poison of afflictions. 'Mark of a deer' refers to the moon.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "a3f7cda9-3db4-400b-b82f-def0d580b77b",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "By pronouncing the two Tāras with the syllable PHAT, all poisons without exception are eliminated. This mantra called 'Tāra' dispels both stationary and moving poisons.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5589bb1f-56fa-4709-950c-db79709479f7",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who are worshipped by the hosts of gods, kings, kiṃnaras and humans. This pair of lines refers to the chief of the divine hosts or the king of kiṃnaras and humans who worship at her feet with offerings such as trees.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "22d5f290-4e17-4d65-b9a6-b8b01a0f161c",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "With the brilliance of joyful armor in all directions. This indicates that she abides in the form of the divine body and the armor of mantras.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "3114d978-5574-42d0-b5d1-b8dfcf22a27b",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Dispeller of disputes and bad dreams. This means she dispels the disputes of non-Buddhists and bad dreams.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "ac631470-e9c5-449c-96c8-3144f42a8b73",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you whose two eyes—the sun and full moon—radiate brilliant light. By twice pronouncing HARA TUTTĀRE, you dispel extremely violent epidemic diseases. This means: The sun and full moon refer to her right eye symbolizing the moon and left eye symbolizing the sun. 'Radiate brilliant light' means light emerges and shines from the aforementioned sun and moon. 'By twice pronouncing HARA' refers to dispelling extremely violent epidemic diseases and so forth through the speech of mantras in both peaceful and wrathful forms.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "3f387b7c-aa26-4bbf-9495-3342068d1dac",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Homage to you who arranges the three essences. This refers to placing the three syllables Om Ah Hum on the body, speech, and mind.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "eac5a342-8a7f-45f6-864a-e5c4b49bb553",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "Endowed with the power of pacification and perfection. This means possessing the power to pacify afflictions. The hosts of spirits, zombies, and yakshas. This refers to pacifying all obstacles. The supreme destroyer, Ture herself. This means destroying all adverse conditions through the power of the ten-syllable mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "e135c0ca-f4ca-4945-9f62-fb9a5a6eff5c",
        "text_id": "a3b5957b-adca-409a-b909-5816d34fb14a",
        "content": "This praise of the root mantra. This refers to this praise of the peaceful and wrathful forms. The twenty-one homages. This is the praise itself.",
        "type": "source",
        "mapping": [],
        "text": null
      }
    ]
  }