{
    "segments": [
      {
        "id": "fccb5f11-9726-44e6-801f-b061fa8a1d66",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the Noble Lady, Arya Tara. 'Homage to Tara' means she liberates from the suffering of samsara. 'Swift One' means she is swift in accomplishing the welfare of sentient beings. 'Heroine' means she is heroic in destroying the afflictions.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2e95e7b7-bb3a-48bb-8ea3-471cc8c6d879",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "The line 'Eyes like flashes of lightning' is a simile for clear light.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2c21f444-ca94-4e16-b3ff-efe617ad96fc",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Protector of the three worlds' refers to Avalokiteshvara, the protector of the three worlds. 'Lotus face' refers to the lotus or utpala that arose from his tears. 'Born from the opening of a thousand petals' means Tara emerged from the opened lotus.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "d30cad8a-c06a-4026-922d-8b4e30c925b8",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you whose face is like the autumn moon' is a simile for white light. 'Full' means like the full moon. 'Face like a hundred' means her face is as radiant as hundreds of full moons stacked together.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "db983043-7b82-4bb9-9bbd-b8c0a94da1be",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "The one blazing with brilliant light, revealed by thousands of stars assembled. This is a simile for the immeasurable rays of light emanating from those two.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5ae3b6a5-91b6-4fe9-8c13-af1cf873b609",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the golden-blue one. This refers to her color, which is as bright as refined gold. 'Born from water' refers to her lotus emblem. 'Whose hands are adorned with lotuses' means she holds a lotus in her left hand. 'Giving' is the perfection of generosity. 'Diligence' is the perfection of diligence. 'Austerity' is the perfection of moral discipline. 'Peace' is the pacification of afflictions. 'Patience' is the perfection of patience. 'Meditation' is the perfection of meditation. 'Whose sphere is reality itself' is the perfection of wisdom. From practicing these six perfections, one attains the form of Tara, which is symbolized by the utpala flower.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "ff9a0be7-a7ea-4c40-9a5e-019fd9c6ae91",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the crown of the Tathagatas' means she is like the crown protuberance on the head of all the Tathagatas. 'Who engages in boundless complete victory' means she engages in complete victory over all adversaries such as demons and enemies.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "7d86c366-0036-4a3a-bf37-e07aee393e9f",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Who has attained all perfections without exception' means she has attained the ten perfections, which are the essence of the ten stages without exception. 'Extremely relied upon by the sons of the Victorious Ones' - 'sons of the Victorious Ones' refers to all bodhisattvas. 'Extremely relied upon' means she is held in highest esteem by them.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "03b8c3f8-e29a-4d45-9785-99ef0fa81ae0",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the syllables TUTTARE HUM' - 'TUTTARE HUM' refers to the mantra. 'Syllables' means through the power and light rays of those mantra syllables. 'Filling the realms of desire, directions, and space' means filling the desire realm, form realm, and formless realm.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "e47f5cab-8e91-4127-9a2a-92d042704757",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "By 'Trampling the seven worlds with your feet,' it means trampling the five types of beings in the desire realm, the form realm making six, and the formless realm making seven. By 'Able to summon without remainder,' 'without remainder' means accomplishing the welfare of sentient beings without exception. 'Able to summon' means having the power to subjugate kings and others.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "4e75e6e7-106b-419b-94fc-270d18105ce3",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you whom Indra, Fire God, Brahma, Wind God, and the Lord of Various Powers worship. This means that the lord of gods Indra, the fire god, Brahma, the wind god, and their master, the great Ishvara (Maheśvara), offer worship at her feet.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "9e3968f6-8d48-41e1-bdc2-2e7735f4f28d",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Praised by hosts of spirits, zombies, gandharvas, and yakṣas from the front. 'Spirits' refers to Gaṇeśa and others. 'Zombies' refers to Maheśvara and others. 'Gandharvas' refers to the Five-Crested One and others. 'Yakṣas' refers to Vaiśravaṇa and others. 'By hosts' means that she is praised from the front by the eight classes of gods and demons and so forth.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "582435ec-d618-4f4c-baed-a1f14d3f26a1",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who utterly destroy others' magical devices with ṬRĀṬ and PHAṬ. This means that with her fierce speech, she destroys and repels the evil spells cast by others. 'Right leg bent, left extended' describes her posture. 'Trampling with your feet' has the meaning explained above.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5f7fd953-36bf-4d14-905a-be62d76e1a83",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Blazing in the tumult of a raging fire. This means she abides majestically in the midst of blazing fire. Homage to TURE, the great terrifier. Here, TURE means 'terrifying demon-dispeller'; she is the great terrifier because she frightens demons. Destroyer of the demon heroes. 'Heroes' refers to the demon of afflictions. By conquering this one, she consequently destroys the other three demons.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "96f7e6a0-8997-4048-b75c-038276d10d66",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "The lotus face displays a frown. The lotus face refers to the beautiful face of the heroine, like an open lotus. 'Displaying a frown' means she abides in wrathful form. 'She who slays all enemies without exception' means she destroys all adverse factors such as afflictive emotions.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "d7bae0b3-2a19-4d64-9131-afd86ea7b2d3",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you whose fingers form a mudra symbolizing the Three Jewels, adorning your heart. This means she is adorned by holding a lotus at her heart with the thumb and ring finger of her left hand. The three extended fingers symbolize the Three Jewels.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "398d9117-fbd6-41d7-bad2-c1feb937fa1b",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Adorned with a wheel in all directions without exception. This means the palm of her right hand, which makes the supreme giving gesture, is adorned with a wheel. 'She who agitates masses of her own light' means that light rays emanate from the wheel in her hand, outshining other lights.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "a954b3f4-1c69-44de-b83d-d63c325dd981",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who, with intense joy and majesty, multiply garlands of light from your crown. 'With intense joy' means she fulfills the desires of all sentient beings. 'Majesty' means she outshines others. Her crown is beautified with garlands of various precious jewels.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "d12a620d-fd13-4405-8758-abac5ce6c932",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "With laughter, the great laughter of TUTTARE. This means she proclaims the laughing sound of the mantra. 'She who subjugates demons and the world' means that through this laughing sound of the mantra, she brings demons and the world under her control.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "29130c5b-c83f-4f91-82bc-d8715c5f63d8",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who can summon all the hosts who protect the earth. This refers to the earth protectors who are the ten directional guardians. 'Summoning all' means they act as messengers by obeying whatever is commanded.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2b94f1bd-9ff1-4f38-b6dc-4ea62d334225",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "With the syllable HŪṂ moving between your frowning brows. This means that in her wrathful form, her heart is marked with the syllable HŪṂ. You who completely liberate all the destitute. This means that she liberates all sentient beings who are tormented by unfavorable conditions and deprived of favorable conditions from suffering and establishes them in happiness.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "77afd2d7-650b-4311-8471-c66333807108",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you whose head is adorned with a crescent moon. This means her head is adorned with the first-day crescent moon. You whose ornaments all brightly blaze. This means that light rays blaze forth from that moon.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "149b005b-9b45-4f2c-b9f4-ff06cdfbd244",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Amitābha amidst your hair-locks. This means that her head is adorned with Amitābha (Boundless Light) who appears within her hair-locks. You who constantly emit the most brilliant light. This means that Amitābha radiates immeasurable light rays for the benefit of sentient beings.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "829a0b9d-d855-4776-9356-0c15656f6186",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who dwell amidst garlands of flames like the fire at the end of an eon. This means that at the end of the eon, when seven suns rise, all earth, stones, and mountains blaze with fire, and she dwells in the midst of such flames.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "930f1328-56d6-4de0-8875-51a4c4b45697",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "With right leg extended, left leg bent, circling all around with joy. This is the posture opposite to the previous one. Destroyer of the forces of enemies. This is because she conquers all adversities.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "987af1c6-0bdf-4e69-8204-6aa497bf1a57",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who strike the earth's surface with the palm of your hand and pound it with your feet. This refers to striking the earth with the left hand while making the threatening gesture with the index finger.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "bb2d80c4-b06c-4736-807c-0b4603d17c0c",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Making a wrathful frown, with the syllable HŪṂ. This means that by verbally uttering the syllable HŪṂ, light rays emanate from the vajra held in the right hand, filling the abodes of the seven classes and dispelling all their obstacles. The meaning of 'filling the seven levels' is contained in these two lines.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "0a054dae-3fe0-4eed-8a85-c2d9317a90f4",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the blissful one, the virtuous one, the peaceful one. 'Blissful' means endowed with uncontaminated bliss. 'Virtuous' means free from the afflictions that are to be abandoned. 'Whose field of activity is peace, nirvana.' This means that with the exhaustion of conceptual thought comes nirvana; with the cessation of suffering comes peace; and she acts within that state.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5adc5c8e-62d8-4136-aa84-a9ecbe2edf72",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "She who is perfectly endowed with SVĀHĀ and OṂ. She who destroys great negativities. This means that through the nature of her enlightened form, she conquers the afflictions that are to be abandoned by others.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "adf5a804-53e7-476d-a10a-64e3528d11d1",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who, with complete joyful circumambulation, utterly destroy the bodies of enemies. With speech arranged in the ten syllables: OṂ TĀRE TUTTĀRE TURE SVĀHĀ. This is the pacifying mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "0eaeafb8-59b4-4431-8e89-8267b3fe7eb1",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "From the awareness syllable HŪṂ arises Tārā herself. OṂ NAMASTĀRE NAMO HARE HŪṂ HARE SVĀHĀ. This is the wrathful mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "33619ec5-19bb-4556-a106-6dc0eaf89644",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to TURE, who stamps her feet. This means that by manifesting in wrathful form and dancing with her feet, obstacles are naturally pacified. You whose seed syllable is in the form of HŪṂ. This means generating the wrathful form from the syllable HŪṂ.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "cce9c464-a75e-4307-b592-28645caec436",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Mount Meru, Mandara and Vindhya. This means: Outside the three thousand worlds there is a mountain called Mount Mandara, which—there may be a slight textual error here—is penetrated by the light rays of contemplation. You who cause the three worlds to tremble. This refers to causing the desire realm, form realm, and formless realm to tremble.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "cf343511-b5f3-4a14-97ac-1e0de43adaf6",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who hold in your hand the mark of a wild animal in the form of a divine lake. This means holding in her hand a moon disc like a divine lake, which is a sign of eliminating the poison of afflictions. 'The mark of a wild animal' refers to the moon.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "72a4d62e-0ce8-49d2-9282-89350afbc44c",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "By pronouncing the two Tāras with the syllable PHAT, she dispels all poisons without exception. This means that the mantra 'Tāre' dispels both stationary and moving poisons.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "6ad75f22-9702-4fac-a195-11dc85adb925",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to you who are worshipped by the hosts of gods, kings, gods, and kinnara. This pair of lines refers to her being worshipped at her feet by the leaders of the divine hosts or the kings of kinnaras such as Druma and others.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "70eeb9b1-31f1-433d-bced-a4042ab8c2a4",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "With the armor of universal joy. This refers to assuming the form of the deity's body and mantra as armor.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "c9747f5b-35ba-4f96-a571-8c1f925a679c",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "She who dispels disputes and bad dreams. This means she dispels disputes with non-Buddhists and bad dreams.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "2f1402dd-e34c-46e8-b471-f1e0f9b2d5da",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to her whose two eyes—the sun and full moon—radiate brilliant light. By pronouncing the two HARAs and TUTTĀRA, she dispels extremely severe fevers. This means that 'the sun and full moon' symbolize her right eye as the moon and her left eye as the sun. 'Radiate brilliant light' means that light emerges and shines from the aforementioned sun and moon. 'By pronouncing the two HARAs' means that through the mantric speech of both peaceful and wrathful forms, she dispels extremely severe fevers and the like.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "80cfed17-3e1d-4c9f-9f3e-32b5a6ff191e",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "Homage to the one who arranges the three realities. This refers to placing the three syllables Om Ah Hum on the body, speech, and mind.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "71f6795d-71f2-4fa7-a09e-bc47dcb4c0ba",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "She who possesses the power of pacification refers to one who has the power to pacify afflictions. The line 'Hosts of spirits, zombies, and yakṣas' refers to the pacification of all obstacles. 'The destroyer, Tara, the supreme one' refers to destroying all adverse conditions through the power of the ten-syllable mantra.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "0fc6dda8-fbc3-442a-a372-2c936ae01c7d",
        "text_id": "d227c1eb-68cf-4dca-ba4b-81f4d45bd1b0",
        "content": "This praise with the root mantra' refers to this praise with the root mantras of the peaceful and wrathful forms. 'Prostrations' refers to this very praise with twenty-one prostrations.",
        "type": "source",
        "mapping": [],
        "text": null
      }
    ]
  }