{
  "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
  "segments": [
    {
      "content": "OM! Homage to the venerable noble lady Tārā! Homage to Tārā, the swift heroine,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Whose eyes are like a flash of lightning.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Who arose from the opening stamens of the lotus-face of the Protector of the Three Worlds.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her whose face is like a hundred full autumn moons gathered together,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Shining with the brilliant light of a thousand gathered stars.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, golden-blue, hand adorned with a water-born lotus; whose sphere of action is generosity, diligence, austerity, peace, patience, and meditation.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, the Tathāgata's crown protuberance, who enjoys limitless, complete victory.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Having attained every single perfection, she is deeply revered by the Children of the Victors.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who, with TUTTĀRA and HŪṂ, fills the realms of desire, the directions, and space.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Trampling the seven worlds underfoot, she is able to summon all beings without exception.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, whom Indra, Agni, Brahmā, Vāyu, and the varied mighty ones all worship.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Praised from the front by the hosts of spirits, risen-corpses, gandharvas, and yakṣas.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who with TRAṬ and PHAṬ utterly destroys the magical wheels of others; with right leg bent and left extended, she tramples them underfoot.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "In a maelstrom of fire, intensely blazing; Homage to TURE, the great and fearsome one, who utterly vanquishes the warriors of Māra.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Her lotus-face marked with a wrathful frown, she slays all foes without a single one remaining.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, whose fingers at her heart display the mudrā of the Three Jewels,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Adorned with a wheel of every direction, from which swirls a great mass of her own light.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, resplendent in supreme joy, whose crown emits a garland of light.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "With the great joyful laughter of TUTTĀRA, she brings demons and the world under her power.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, with the power to summon the entire assembly of protectors of the earth.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Frowning wrathfully, by the syllable HŪṂ she brings complete liberation from all poverty.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, crowned with a crescent moon, all her ornaments intensely blazing.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "With Amitābha in her topknot, from whom she eternally sends forth great rays of light.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who dwells in the center of a blazing garland, like the fire at the end of an eon.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "With right leg extended and left bent, she rejoices in the surrounding retinue, utterly destroying the armies of her foes.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who strikes the surface of the earth with her palm and stomps upon it with her foot.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "With wrathful glance and the syllable HŪṂ, she crushes all seven levels.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to the blissful, virtuous, and peaceful one, whose sphere of action is the peace of nirvana.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Perfectly endowed with SVĀHĀ and OṂ, she is the one who overcomes great wrongdoing.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, surrounded by a retinue of the truly joyous, who shatters the bodies of foes, having arrayed the ten-syllable mantra.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "The Liberator herself, from the awareness-syllable HŪṂ.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who stamps her foot with TURE, whose seed syllable is in the form of HŪṂ,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Shaking Mount Meru, Mandara, and Vindhya, and causing the three worlds to tremble.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her who holds in her hand a moon marked like a deer, in the form of a celestial lake.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "By twice saying TĀRĀ and uttering PHAṬ, she completely dispels all poisons.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, whom the hosts of gods, their kings, and the kinnaras all attend.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "By the splendor of her joyous, all-encompassing armor,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "She dispels all disputes and bad dreams.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her whose two eyes, like the full sun and moon, shine with brilliant light; by uttering HARA twice and TUTTĀRE, she dispels the most terrible plagues.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Homage to her, who is arrayed with the three ultimate truths,",
      "type": "source",
      "mapping": []
    },
    {
      "content": "Perfectly endowed with the power of peace; TURE, the most supreme, who vanquishes the hosts of demons, risen-corpses, and yakṣas.",
      "type": "source",
      "mapping": []
    },
    {
      "content": "This is the praise of the root mantra, and these are the twenty-one homages.",
      "type": "source",
      "mapping": []
    }
  ]
}