{
    "segments": [
      {
        "id": "65a73fe9-9253-47be-a391-991f87eeb1a1",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Om! Homage to the noble and exalted Ārya Tārā! <br> Homage to swift-acting heroic Tārā,<br> Whose eyes flash like a lightning bolt, <br> Protector of the three worlds, born from the tears <br> Of the compassionate face of the Lord of the World.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "b5b47ebb-c922-4801-b3b0-a1dab988a6a0",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to you who is like the full moon that teaches, <br> With a face shining like a hundred autumn moons stacked together <br> Surrounded by a host of a thousand stars <br> Radiating supreme light that completely dispels darkness.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "853307ce-a470-48b4-a54d-742c9ee21a14",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to she who was born from blue-green water, <br> With a lotus in her hand, completely adorned, <br> Generous, diligent, able to endure hardship, and calm,  <br> She herself is the field of patience, contemplation, and conduct.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "312e9fbf-959b-4a4a-b344-768c5dddde42",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the crown ornament of the Tathāgatas! <br> The one who acts as the victorious sovereign in boundless ways, <br> Who has attained perfect transcendence without omission, <br> And is utterly devoted to the sons of the Victorious Ones.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "e3bb36fa-7c38-4547-846e-c07afed62308",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the syllables TUTTARA and HŪṂ! <br> [She who] overpowers desire, directions, and the vast sky,<br>\nSubduing the seven worlds beneath her feet, <br> And able to immobilize them, rendering them powerless.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "3876b7f8-7649-4770-b4f2-4033fec8365e",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the pure fire goddess of a hundred blessings, <br> Worshipped by multitudes of powerful wind deities, <br> Who overcomes poisons, rotting substances, foul odors, <br> And is praised before the hordes of harmful spirits and demons",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5524af10-9e06-4cc7-8480-adf6359525c0",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to you who is invoked with “TUTTĀRE” and “PHAT,” <br> Who utterly destroys external illusions and samsaric wheels, <br> With right leg drawn in and left leg extended, subduing with her feet, <br> Blazing with intensely burning fire of wrathful power.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "88bc855d-345d-4186-88b6-720a78e37295",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the great terrifying one who inspires awe and fear. <br> The heroine who completely vanquishes demons. <br> Whose water-born face displays fierce compassion. <br> The one who slays all enemies without exception. ",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "bbb20784-c610-4f9b-877c-948e020360cb",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the Three Jewels, symbolized by the mudra of the hand. <br> Whose fingertips are adorned completely with wisdom mind. <br> Adorned by the wheel of all directions without omission. <br> The radiant hosts of your own light stir all beings.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "fed81fcd-339a-4c49-85e1-e5be3f1b08f9",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one who radiates supreme joy and brilliance. <br> Adorned with a crown of light-spreading garlands. <br> Uttered the perfect laughter “Tuttara.” <br> Who subjugates demons and worldly powers.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "02ae9c66-c445-466f-b635-154445f3771f",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the assembly who guards the foundation of the earth. <br> Who is capable of halting everything without exception. <br> With the fierce syllable HŪṂ of wrathful movement. <br> Liberates all who are destitute completely.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "5bf99e15-b9e4-478b-9b2c-0ea1034db558",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one whose crown is adorned with a crescent moon. <br> Fully adorned and radiantly blazing with all ornaments. <br> From the center of matted locks shines boundless light. <br> Continuously emanating supreme and brilliant light.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "372b3ed3-3e4d-456e-ae4a-689d48fec83a",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one who dwells like a flame at the end of an eon. <br> Abiding in the center of a blazing garland. <br> Surrounded joyfully on all sides with right extended and left drawn in. <br> Who utterly destroys the hosts of enemies.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "7d59ce6f-d090-4fa1-ac3e-2bec3204adc2",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one who presses the surface of the earth with her palms. <br> Striking with her heel and stamping the ground forcefully. <br> With wrathful eyes and the seed syllable HŪṂ. <br> Who subdues the seven stages of existence.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "c34a5d7f-6013-4558-9f3a-390c1a33ca5d",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the blissful, virtuous, and peaceful Lady. <br> Who is the very realm of peace beyond sorrow. <br> Empowered with the true syllables Svāhā and Oṁ. <br> Who utterly conquers great negativities.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "3a3e16b9-1c29-4435-8f57-d6ae5700c22b",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one who delights in being completely encircled. <br> Who utterly subjugates the bodies of enemies. <br> Who embodies the mantra composed of the ten seed syllables. <br> Who is the very Tara arising from the wisdom HŪṂ.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "d6b23a93-8c82-4934-a58c-d76c63e70232",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to you whose foot tramples with confidence. <br> Who is the seed of the HŪṂ syllable in its full expression. <br> Who shakes Mount Meru, Mandhara, and all. <br> And stirs the three realms of the world.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "cdb97821-150e-4468-ab61-09d08d162570",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one whose form is that of a divine lake. <br> Who holds in her hand the marked emblems of beasts and gods. <br> Uttering the two syllables TĀRE with the letter PHAT. <br> Who clears away every single poison without exception.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "640dd9be-ce58-4129-8dcb-91579b9aacd5",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the queen of all divine assemblies. <br> Worshipped by gods, humans, and all beings. <br> With the radiance of universal delight and splendor. <br> Who dispels harmful conflicts and evil dreams.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "4abb4d0b-0347-4e34-8aea-651b722536c9",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to the one whose two eyes shine brightly like the sun and moon. <br> From whom supreme radiant light beams forth. <br> Uttering the two syllables HĀRĀ and TUTTĀRĀ. <br> Who dispels highly infectious epidemic diseases.",
        "type": "source",
        "mapping": [],
        "text": null
      },
      {
        "id": "ddc66a75-c91e-4e9f-9870-16837ad33cf4",
        "text_id": "f6d18089-518b-4720-b6dc-47c33e2df1df",
        "content": "Homage to you who embodies the threefold expression. <br> Possessing the power of peace and perfect truth. <br> Who subdues demons, zombies, and all harmful spirits. <br> To you, supreme one, we offer perfect devotion. <br> Together with this praise of the root mantra. <br> This homage comprises twenty-one in all.",
        "type": "source",
        "mapping": [],
        "text": null
      }
    ]
  }