{
  "text_id": "85eedd68-d56e-4086-bf0d-fd46cf9d0dfc",
  "segments": [
    {
      "content": "༄༅། །ཨོཾ་རྗེ་བཙུན་མ་འཕགས་མ་སྒྲོལ་མ་ལ་ཕྱག་འཚལ་ལོ།<br> ཕྱག་འཚལ་སྒྲོལ་མ་མྱུར་མ་དཔའ་མོ། །<br> སྤྱན་ནི་སྐད་ཅིག་གློག་དང་འདྲ་མ། ། <br>འཇིག་རྟེན་གསུམ་མགོན་ཆུ་སྐྱེས་ཞལ་གྱི། ། <br>གེ་སར་བྱེ་བ་ལས་ནི་བྱུང་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་སྟོན་ཀའི་ཟླ་བ་ཀུན་ཏུ། ། <br>གང་བ་བརྒྱ་ནི་བརྩེགས་པའི་ཞལ་མ། ། <br>སྐར་མ་སྟོང་ཕྲག་ཚོགས་པ་རྣམས་ཀྱིས། །<br>རབ་ཏུ་ཕྱེ་བའི་འོད་རབ་འབར་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་སེར་སྔོ་ཆུ་ནས་སྐྱེས་ཀྱིས། ། <br>པདྨས་ཕྱག་ནི་རྣམ་པར་བརྒྱན་མ། ། <br>སྦྱིན་པ་བརྩོན་འགྲུས་དཀའ་ཐུབ་ཞི་བ། །<br>བཟོད་པ་བསམ་གཏན་སྤྱོད་ཡུལ་ཉིད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་དེ་བཞིན་གཤེགས་པའི་གཙུག་ཏོར། ། <br>མཐའ་ཡས་རྣམ་པར་རྒྱལ་བར་སྤྱོད་མ། ། <br>མ་ལུས་ཕ་རོལ་ཕྱིན་པ་ཐོབ་པའི། །<br>རྒྱལ་བའི་སྲས་ཀྱིས་ཤིན་ཏུ་བསྟེན་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཏུཏྟཱ་ར་ཧཱུཾ་ཡི་གེས། །<br>འདོད་དང་ཕྱོགས་དང་ནམ་མཁའ་གང་མ། ། <br>འཇིག་རྟེན་བདུན་པོ་ཞབས་ཀྱིས་མནན་ཏེ། །<br>ལུས་པ་མེད་པར་འགུགས་པར་ནུས་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་བརྒྱ་བྱིན་མེ་ལྷ་ཚངས་པ། །<br>རླུང་ལྷ་སྣ་ཚོགས་དབང་ཕྱུག་མཆོད་མ། ། <br>འབྱུང་པོ་རོ་ལངས་དྲི་ཟ་རྣམས་དང་། །<br>གནོད་སྦྱིན་ཚོགས་ཀྱིས་མདུན་ནས་བསྟོད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཊད་ཅེས་བྱ་དང་ཕཊ་ཀྱིས། །<br>ཕ་རོལ་འཁྲུལ་འཁོར་རབ་ཏུ་འཇོམས་མ། ། <br>གཡས་བསྐུམས་གཡོན་བརྐྱངས་ཞབས་ཀྱིས་མནན་ཏེ། །<br>མེ་འབར་འཁྲུག་པ་ཤིན་ཏུ་འབར་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཏུ་རེ་འཇིགས་པ་ཆེན་མོ། ། <br>བདུད་ཀྱི་དཔའ་བོ་རྣམ་པར་འཇོམས་མ། །<br> ཆུ་སྐྱེས་ཞལ་ནི་ཁྲོ་གཉེར་ལྡན་མཛད། །<br> དགྲ་བོ་ཐམས་ཅད་མ་ལུས་གསོད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་དཀོན་མཆོག་གསུམ་མཚོན་ཕྱག་རྒྱའི། །<br>སོར་མོས་ཐུགས་ཀར་རྣམ་པར་བརྒྱན་མ། ། <br>མ་ལུས་ཕྱོགས་ཀྱི་འཁོར་ལོ་བརྒྱན་པའི། ། <br>རང་གི་འོད་ཀྱི་ཚོགས་རྣམས་འཁྲུག་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་རབ་ཏུ་དགའ་བ་བརྗིད་པའི། ། <br>དབུ་རྒྱན་འོད་ཀྱི་ཕྲེང་བས་སྤེལ་མ། །<br> བཞད་པ་རབ་བཞད་ཏུཏྟཱ་ར་ཡིས། ། <br>བདུད་དང་འཇིག་རྟེན་དབང་དུ་མཛད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ས་གཞི་སྐྱོང་བའི་ཚོགས་རྣམས། །<br>ཐམས་ཅད་འགུགས་པར་ནུས་མ་ཉིད་མ། ། <br>ཁྲོ་གཉེར་གཡོ་བ་ཡི་གེ་ཧཱུཾ་གིས། །<br>ཕོངས་པ་ཐམས་ཅད་རྣམ་པར་སྒྲོལ་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཟླ་བའི་དུམ་བུས་དབུ་རྒྱན། །<br>བརྒྱན་པ་ཐམས་ཅད་ཤིན་ཏུ་འབར་མ། ། <br>རལ་བའི་ཁྲོད་ན་འོད་དཔག་མེད་ལས། །<br>རྟག་པར་ཤིན་ཏུ་འོད་རབ་མཛད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་བསྐལ་པའི་ཐ་མའི་མེ་ལྟར། །<br>འབར་བའི་ཕྲེང་བའི་དབུས་ན་གནས་མ། ། <br>གཡས་བརྐྱངས་གཡོན་བསྐུམས་ཀུན་ནས་བསྐོར་དགའི། །<br>དགྲ་ཡི་དཔུང་ནི་རྣམས་པར་འཇོམས་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ས་གཞིའི་ངོས་ལ་ཕྱག་གི། །<br>མཐིལ་གྱིས་བསྣུན་ཅིང་ཞབས་ཀྱི་རྡུང་མ། ། <br>ཁྲོ་གཉེར་སྤྱན་མཛད་ཡི་གེ་ཧཱུཾ་གིས། །<br>རིམ་པ་བདུན་པོ་རྣམས་ནི་འགེམས་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་བདེ་མ་དགེ་མ་ཞི་མ། །<br>མྱ་ངན་འདས་ཞི་སྤྱོལ་ཡུལ་ཉིད་མ། ། <br>སྭཱ་ཧཱ་ཨོཾ་དང་ཡང་དག་ལྡན་པས། །<br>སྡིག་པ་ཆེན་པོ་འཇོམས་པ་ཉིད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཀུན་ནས་བསྐོར་རབ་དགའ་བའི། །<br>དགྲ་ཡི་ལུས་ནི་རྣམ་པར་འགེམས་མ། ། <br>ཡི་གེ་བཅུ་པའི་སྔགས་ནི་བཀོད་པའི། །<br>རིག་པ་ཧཱུཾ་ལས་སྒྲོལ་མ་ཉིད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཏུ་རེའི་ཞབས་ནི་བརྡབས་པས། །<br>ཧཱུཾ་གི་རྣམ་པའི་ས་བོན་ཉིད་མ། ། <br>རི་རབ་མནྡྷ་ར་དང་འབིགས་བྱེད། །<br>འཇིག་རྟེན་གསུམ་རྣམས་གཡོ་བ་ཉིད་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ལྷ་ཡི་མཚོ་ཡི་རྣམ་པའི། །<br>རི་དྭགས་རྟགས་ཅན་ཕྱག་ན་བསྣམས་མ། ། <br>ཏཱ་ར་གཉིས་བརྗོད་ཕཊ་ཀྱི་ཡི་གེ། །<br>དུག་རྣམས་མ་ལུས་པ་ནི་སེལ་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ལྷ་ཡི་ཚོགས་རྣམས་རྒྱལ་པོ། །<br>ལྷ་དང་མིའམ་ཅི་ཡིས་བསྟེན་མ། ། <br>ཀུན་ནས་གོ་ཆ་དགའ་བའི་བརྗིད་ཀྱིས། ། <br>རྩོད་དང་རྨི་ལམ་ངན་པ་སེལ་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་ཉི་མ་ཟླ་བ་རྒྱས་པའི། །<br>སྤྱན་གཉིས་པོ་ལ་འོད་རབ་གསལ་མ། ། <br>ཧ་ར་གཉིས་བརྗོད་ཏུཏྟཱ་ར་ཡིས། །ཤིན་ཏུ་གྲགས་པོའི་རིམས་ནད་སེལ་མ། །",
      "type": "source",
      "mapping": []
    },
    {
      "content": "ཕྱག་འཚལ་དེ་ཉིད་གསུམ་རྣམས་བཀོད་པས། །<br>ཞི་བའི་མཐུ་དང་ཡང་དག་ལྡན་མ། ། <br>གདོན་དང་རོ་ལངས་གནོད་སྦྱིན་ཚོགས་རྣམས། །<br>འཇོམས་པ་ཏུ་རེ་རབ་མཆོག་ཉིད་མ། ། <br>རྩ་བའི་སྔགས་ཀྱི་བསྟོད་པ་འདི་དང་། །<br>ཕྱག་འཚལ་བ་ནི་ཉི་ཤུ་རྩ་གཅིག །",
      "type": "source",
      "mapping": []
    }
  ]
}